MATRIXQUOTELQ = [
    """
الكِلامُ لا يَنتهي، تِنتَهيّ الجدوى مَن الكِلام.
""",
"""
- لَم تكن الأغاني جَميله بل التَفكير بك.

اين بوابة هذا العالم ارين ان أخرج .

تَنضج لِتدرك أن لاشيء يدوم .

مَحدش هيعرف يضايقك
طول ما أنتَ مُش مهتم .

وين سَارِح؟ چَنّك مضَيِّع عُمر..
""",
"""︎
العنده مثلج يخجُل يباوع لغيَرچ.

"‏الليلُ تأريخ الحنين وانتِ ليلي.

- يا مَحلى النِفوس بِكيفهَا مِن تِحنّ ،

اللهّم حياةً تُرضينا وتُرضيك عنّا .

عايز أروح مَكان مَحدِش يعرفني فيه .

وكُل شيء يَنتهي حتى الاحلام .

‏⠀⠀ لا تبالغ بالشعور ، أكثرهم مؤقتين .
""",
"""
- إن الحياة بحد ذاتها مملة، حمقاء، قذرة ، تشدك كالمستنقع
""",
"""
-الصافُن ع الدَرب بعيونه تِلكه أعزاز
-ويلتم التعب بيه واكول ايام وتعدي..
-الحقيقيون لا يحتملهم أحَد .
-اللهم لا احتياج ولا انحناء الا لك.
-لا يغرك المظهر ، حتى الملح بيشبه السكر.
- صدا؏ و قلة نوم يا لها من فوضى . .
-أنا الحربُ التي لا يمكن الفوز بها.
- وإن لم استطع ان اضيئك ، سأنطفئ معك
-كمل غيبتك اصلاً بديت انساك .
-وإن عاد الحديث لن يعود الشِعور ..
-بطريقة ما سيصَلح الله كل شيء .
""",
]
